Example/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("libFieldSource.so");
application     buoyantBoussinesqPimpleFoam_DNPInOF;
//application     buoyantBoussinesqSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime        600;

deltaT          1;

writeControl    timeStep;

writeInterval   1;	;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.8;
functions
{ #includeFunc residuals
 

}

// ************************************************************************* //
