Example/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
6400
(
(1.73081e-06 -1.16006e-06 0)
(9.05834e-06 -1.74668e-06 0)
(1.68528e-05 -1.54892e-06 0)
(2.15722e-05 -9.41428e-07 0)
(2.10054e-05 -2.12218e-07 0)
(1.43747e-05 5.44757e-07 0)
(1.51276e-06 1.27846e-06 0)
(-1.74312e-05 1.96354e-06 0)
...
)
;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (0.5 0 0);
    }
    fixedWalls
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
