Example/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 900;

boundaryField
{
    movingWall
    {
        type            fixedValue;//zeroGradient;
        value           uniform 900; 
        
    }
   
  

    fixedWalls
    {
        type            fixedValue;
        value           uniform 900;
    }

    frontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
