Example/0/dnp1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dnp1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
2.229258E+016
3.327128E+016
5.252535E+016
7.350316E+016
7.610974E+016
7.481122E+016
9.188538E+016
1.198313E+017
...
); 
boundaryField
{
    movingWall
    {
        type           fixedValue; //fixedGradient;//fixedValue;
        //gradient        uniform 0; 

        value           uniform 0;
        
    }
   
  

    fixedWalls
    {
        type           fixedValue;//type            fixedValue;
       value       uniform 0; 
    }

    frontAndBack
    {
        type            empty;
    }

}
