Example/0/dnp1_s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dnp1_s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
35537822697834.4
57700672242895.7
78061473272209.3
98808591430204.8
125455296292042
146163235645758
161289254276276
185317509052113
...
); 
boundaryField
{
    movingWall
    {
        type           fixedValue; //fixedGradient;//fixedValue;
        //gradient        uniform 0; 
        //gradient        uniform 0; 
        value           uniform 0;
        
    }
   
  
  
    fixedWalls
    {
        type           fixedValue;//type            fixedValue;
       value       uniform 0; 
    }
    frontAndBack
    {
        type            empty;
    }
}

