Example/0/dnp3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dnp3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
1.904883E+016
2.843004E+016
4.488249E+016
6.280786E+016
6.502326E+016
6.39178E+016
7.851532E+016
1.023642E+017
...
); 
boundaryField
{
    movingWall
    {
        type           fixedValue; //fixedGradient;//fixedValue;
        //gradient        uniform 0; 

        value           uniform 0;
        
    }
   
  

    fixedWalls
    {
        type            fixedValue;
       value       uniform 0; 
    }

    frontAndBack
    {
        type            empty;
    }

}
