Example/0/dnp4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dnp4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
1.22878E+016
1.833932E+016
2.895228E+016
4.051537E+016
4.194182E+016
4.122963E+016
5.064776E+016
6.602509E+016
...
)
;
boundaryField
{
    movingWall
    {
        type           fixedValue; //fixedGradient;//fixedValue;
        //gradient        uniform 0; 

        value           uniform 0;
        
    }
   
  

    fixedWalls
    {
        type            fixedValue;
       value       uniform 0; 
    }

    frontAndBack
    {
        type            empty;
    }

}
