Example/0/dnp4_s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dnp4_s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
209971693459599
340918687326795
461218456636507
583800742306647
741240149682019
863590951280887
952961529049703
1.09493008432838E+015
...
)
;
boundaryField
{
    movingWall
    {
        type           fixedValue; //fixedGradient;//fixedValue;
        //gradient        uniform 0; 
        value           uniform 0;
        value           uniform 0;
        
    }
   
  
    fixedWalls
    
    {
        type            fixedValue;
       value       uniform 0; 
    }
    
    frontAndBack
    {
        type            empty;
    }
}
}

