Example/0/dnp5_s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dnp5_s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
327007670630307
530943118952022
718296693575172
909205034776146
1.15439948467062E+015
1.34494731505374E+015
1.48413209742865E+015
1.70523240766338E+015
...
); 
boundaryField
{
    movingWall
    {
        type           fixedValue; //fixedGradient;//fixedValue;
        //gradient        uniform 0; 
        //gradient        uniform 0; 
        value           uniform 0;
        
    }
   
  
  
    fixedWalls
    {
        type            fixedValue;
       value       uniform 0; 
    }
    }
    frontAndBack
    {
        type            empty;
    }
    }
}
}

