Example/0/dnp8_s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dnp8_s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
25310152521229.7
41094605808086.4
55595634300688.5
70371799104584.6
89349668682463.8
104097930214954
114870729714589
131983730653515
...
); 
boundaryField
{
    movingWall
    {
        type           fixedValue; //fixedGradient;//fixedValue;
        //gradient        uniform 0; 
        //gradient        uniform 0; 
        value           uniform 0;
        
    }
   
  
  
    fixedWalls
    {
        type            fixedValue;
       value       uniform 0; 
    }
    }
    frontAndBack
    {
        type            empty;
    }
    }
}
}

