Example/0/sss/dnp2_s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dnp2_s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
171691517200721
278765416922630
377133199604991
477367370515692
606103821958663
706148710920212
779226037856119
895312145697508
...
); 
boundaryField
{
    movingWall
    {
        type           fixedValue; //fixedGradient;//fixedValue;
        //gradient        uniform 0; 
        //gradient        uniform 0; 
        value           uniform 0;
        
    }
   
  
  
    fixedWalls
    {
        type            fixedValue;
       value       uniform 0; 
    }
    }
    frontAndBack
    {
        type            empty;
    }
    }
}
}

