Example/0/sss/dnp4_s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dnp4_s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
228994072340130
371804204945538
503002528023833
636690151959522
808392777430989
941827946003343
1.03929504841831E+015
1.19412524044019E+015
...
)
;
boundaryField
{
    movingWall
    {
        type           fixedValue; //fixedGradient;//fixedValue;
        //gradient        uniform 0; 
        value           uniform 0;
        value           uniform 0;
        
    }
   
  
    fixedWalls
    
    {
        type            fixedValue;
       value       uniform 0; 
    }
    
    frontAndBack
    {
        type            empty;
    }
}
}

