Example/0/sss/dnp6_s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      dnp6_s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
106563897784020
173021532333096
234075534941442
296287950077284
376190896223471
438285829595446
483642786799239
555694035060341
...
); 
boundaryField
{
    movingWall
    {
        type           fixedValue; //fixedGradient;//fixedValue;
        //gradient        uniform 0; 
        //gradient        uniform 0; 
        value           uniform 0;
        
    }
   
  
  
    fixedWalls
    {
        type            fixedValue;
       value       uniform 0; 
    }
    }
    frontAndBack
    {
        type            empty;
    }
    }
}
}

