Example/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

   rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-4;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-4;
        relTol          0;
    }
yPsi
   {
     solver GAMG;
     preconditioner DILU;
     smoother  GaussSeidel;
     tolerance 1e-6;
     relTol 0;
   }
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|T|k|epsilon|R|h)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }
dnp1
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;

}
dnp1Final
    {
        $dnp1;
        relTol          0;
    }

dnp2
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
}
dnp2Final
    {
        $dnp2;
        relTol          0;
    }
dnp3
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
}

dnp3Final
    {
        $dnp3;
        relTol          0;
    }
dnp4
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
}

dnp4Final
    {
        $dnp4;
        relTol          0;
    }

dnp5
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
}

dnp5Final
    {
        $dnp5;
        relTol          0;
    }

dnp6
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
}

dnp6Final
    {
        $dnp6;
        relTol          0;
    }

dnp7
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
}

dnp7Final
    {
        $dnp7;
        relTol          0;
    }

dnp8
{
    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
}

dnp8Final
    {
        $dnp8;
        relTol          0;
    }

    "(U|T|k|epsilon|R|h)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}
//SIMPLE
//{
   // nNonOrthogonalCorrectors 0;
//
   // residualControl
  //  {
    //    p               1e-5;
    //    U               1e-5;
      //  nuTilda         1e-5;
  //  }
//}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        nuTilda         0.7;
    }
}

relaxationFactors
{
    equations
    {
        "(U|T|k|epsilon|R)" 1;
        "(U|T|k|epsilon|R)Final" 1;
    }
}

// ************************************************************************* //
